wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_hdsl.h
/* HDSL safe channel 1 interface registers */ 
#define EDIM_HDSL_SAFE_EDGES              REG8((EDIM_HDSL) + (0x200U) + 0x00000009U)                    /*!< edge register */
#define EDIM_HDSL_SAFE_DELAY              REG8((EDIM_HDSL) + (0x200U) + 0x0000000AU)                    /*!< run time delay register */
#define EDIM_HDSL_SAFE_VERSION            REG8((EDIM_HDSL) + (0x200U) + 0x0000000BU)                    /*!< version register */
#define EDIM_HDSL_SAFE_ENC_ID2            REG8((EDIM_HDSL) + (0x200U) + 0x0000000DU)                    /*!< encoder ID 2 register */
#define EDIM_HDSL_SAFE_ENC_ID1            REG8((EDIM_HDSL) + (0x200U) + 0x0000000EU)                    /*!< encoder ID 1 register */
#define EDIM_HDSL_SAFE_ENC_ID0            REG8((EDIM_HDSL) + (0x200U) + 0x0000000FU)                    /*!< encoder ID 0 register */
#define EDIM_HDSL_VPOS4                   REG8((EDIM_HDSL) + (0x200U) + 0x00000019U)                    /*!< safe position 4 register */
#define EDIM_HDSL_VPOS3                   REG8((EDIM_HDSL) + (0x200U) + 0x0000001AU)                    /*!< safe position 3 register */
#define EDIM_HDSL_VPOS2                   REG8((EDIM_HDSL) + (0x200U) + 0x0000001BU)                    /*!< safe position 2 register */
#define EDIM_HDSL_VPOS1                   REG8((EDIM_HDSL) + (0x200U) + 0x0000001CU)                    /*!< safe position 1 register */
#define EDIM_HDSL_VPOS0                   REG8((EDIM_HDSL) + (0x200U) + 0x0000001DU)                    /*!< safe position 0 register */
#define EDIM_HDSL_VPOSCRC_H               REG8((EDIM_HDSL) + (0x200U) + 0x0000001EU)                    /*!< safe position CRC high byte register */
#define EDIM_HDSL_VPOSCRC_L               REG8((EDIM_HDSL) + (0x200U) + 0x0000001FU)                    /*!< safe position CRC low byte register */
#define EDIM_HDSL_SAFE_CTRL               REG8((EDIM_HDSL) + (0x200U) + 0x00000035U)                    /*!< safe system control register */
#define EDIM_HDSL_SAFE_SUM                REG8((EDIM_HDSL) + (0x200U) + 0x00000036U)                    /*!< safe status summary register */
#define EDIM_HDSL_S_PC_DATA               REG8((EDIM_HDSL) + (0x200U) + 0x00000037U)                    /*!< parameter channel short message register */
#define EDIM_HDSL_EVENT_S                 REG8((EDIM_HDSL) + (0x200U) + 0x0000003DU)                    /*!< safe event register */
#define EDIM_HDSL_MASK_S                  REG8((EDIM_HDSL) + (0x200U) + 0x0000003EU)                    /*!< safe event mask register */
#define EDIM_HDSL_ENC_ST(n)               REG8((EDIM_HDSL) + (0x200U) + 0x00000040U + (0x1U * (n)))     /*!< encoder status n register (n = 0 to 7) */
#define EDIM_HDSL_SRSSI                   REG8((EDIM_HDSL) + (0x200U) + 0x0000007CU)                    /*!< slave RSSI register */
#define EDIM_HDSL_MAIL                    REG8((EDIM_HDSL) + (0x200U) + 0x0000007EU)                    /*!< slave Mail register */
#define EDIM_HDSL_PING                    REG8((EDIM_HDSL) + (0x200U) + 0x0000007FU)                    /*!< slave Ping register */

/* HDSL safe channel 2 interface registers */
#define EDIM_HDSL_VERSION2                REG8((EDIM_HDSL) + (0x300U) + 0x0000000BU)                   /*!< version in safe channel 2 register */
#define EDIM_HDSL_ENC2_ID                 REG8((EDIM_HDSL) + (0x300U) + 0x0000000FU)                   /*!< encoder ID in safe channel 2 register */
#define EDIM_HDSL_STATUS2                 REG8((EDIM_HDSL) + (0x300U) + 0x00000018U)                   /*!< safe channel 2 status register */
#define EDIM_HDSL_VPOS24                  REG8((EDIM_HDSL) + (0x300U) + 0x00000019U)                   /*!< safe position channel 2 byte 4 register */
#define EDIM_HDSL_VPOS23                  REG8((EDIM_HDSL) + (0x300U) + 0x0000001AU)                   /*!< safe position channel 2 byte 3 register */
#define EDIM_HDSL_VPOS22                  REG8((EDIM_HDSL) + (0x300U) + 0x0000001BU)                   /*!< safe position channel 2 byte 2 register */
#define EDIM_HDSL_VPOS21                  REG8((EDIM_HDSL) + (0x300U) + 0x0000001CU)                   /*!< safe position channel 2 byte 1 register */
#define EDIM_HDSL_VPOS20                  REG8((EDIM_HDSL) + (0x300U) + 0x0000001DU)                   /*!< safe position channel 2 byte 0 register */
#define EDIM_HDSL_VPOSCRC2_H              REG8((EDIM_HDSL) + (0x300U) + 0x0000001EU)                   /*!< high byte position checksum channel 2 register */
#define EDIM_HDSL_VPOSCRC2_L              REG8((EDIM_HDSL) + (0x300U) + 0x0000001FU)                   /*!< low byte position checksum channel 2 register */
#define EDIM_HDSL_DUMMY2                  REG8((EDIM_HDSL) + (0x300U) + 0x0000003FU)                   /*!< dummy in safe channel 2 register */

/* HDSL general registers */
#define EDIM_HDSL_CTL                     REG32((EDIM_HDSL) + (0x380U) + 0x00000000U)                  /*!< hiperface DSL control register0 */
#define EDIM_HDSL_ONLINE_STATUS_D         REG32((EDIM_HDSL) + (0x380U) + 0x00000004U)                  /*!< online status D */
#define EDIM_HDSL_ONLINE_STATUS_1         REG32((EDIM_HDSL) + (0x380U) + 0x00000008U)                  /*!< online status 1 */
#define EDIM_HDSL_ONLINE_STATUS_2         REG32((EDIM_HDSL) + (0x380U) + 0x0000000CU)                  /*!< online status 2 */
#define EDIM_HDSL_SYNLK                   REG32((EDIM_HDSL) + (0x380U) + 0x00000010U)                  /*!< sync lock status */
#define EDIM_HDSL_INTEN                   REG32((EDIM_HDSL) + (0x380U) + 0x00000014U)                  /*!< interrupt configure  */


/* bits definitions */
/* EDIM_HDSL_SYS_CTRL */
#define EDIM_HDSL_SYS_CTRL_OEN            BIT(0)                               /*!< activation of the output */
#define EDIM_HDSL_SYS_CTRL_SPOL           BIT(1)                               /*!< polarity of the synchronization pulse */
#define EDIM_HDSL_SYS_CTRL_LOOP           BIT(4)                               /*!< test drive interface */
#define EDIM_HDSL_SYS_CTRL_FRST           BIT(5)                               /*!< pipeline FIFO, reset */
#define EDIM_HDSL_SYS_CTRL_MRST           BIT(6)                               /*!< messages reset */
#define EDIM_HDSL_SYS_CTRL_PRST           BIT(7)                               /*!< protocol reset */

/* EDIM_HDSL_SYNC_CTRL */
#define EDIM_HDSL_SYNC_CTRL_ES            BITS(0,7)                            /*!< external synchronization */

