wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_hdsl.h
/* EDIM_HDSL_PC_OFF_H */
#define EDIM_HDSL_PC_OFF_H_LOFFADDH       BITS(0,6)                            /*!< long message offset value, bit 14 to bit 8 */
#define EDIM_HDSL_PC_OFF_H_LID            BIT(7)                               /*!< long message identification */

/* EDIM_HDSL_PC_OFF_L */
#define EDIM_HDSL_PC_OFF_L_LOFFADDL       BITS(0,7)                            /*!< long message offset value, bit 7 to bit 0 */

/* EDIM_HDSL_PC_CTRL */
#define EDIM_HDSL_PC_CTRL_LSTA            BIT(0)                               /*!< control of the long message start */

/* EDIM_HDSL_PIPE_S */
#define EDIM_HDSL_PIPE_S_PSCI             BIT(0)                               /*!< indication for special characters in the SensorHub Channel */
#define EDIM_HDSL_PIPE_S_PERR             BIT(1)                               /*!< coding error of the bits in the SensorHub Channel */
#define EDIM_HDSL_PIPE_S_PEMP             BIT(2)                               /*!< the SensorHub channel buffer is empty */
#define EDIM_HDSL_PIPE_S_POVR             BIT(3)                               /*!< SensorHub Channel overflow */

/* EDIM_HDSL_PIPE_D */
#define EDIM_HDSL_PIPE_D_SCDATA           BITS(0,7)                            /*!< SensorHub Channel data */

/* EDIM_HDSL_PC_DATA */
#define EDIM_HDSL_PC_DATA_PCDATA          BITS(0,7)                            /*!< "short message" Mirror register data */

/* EDIM_HDSL_ACC_ERR_CNT */
#define EDIM_HDSL_ACC_ERR_CNT_CNT         BITS(0,4)                            /*!< position error count/threshold */

/* EDIM_HDSL_MAXACC */
#define EDIM_HDSL_MAXACC_MNT              BITS(0,5)                            /*!< mantissa of fast position acceleration boundary */
#define EDIM_HDSL_MAXACC_RES              BITS(6,7)                            /*!< mantissa of fast position acceleration boundary */

/* EDIM_HDSL_MAXDEV */
#define EDIM_HDSL_MAXDEV_H_DEVH           BITS(0,7)                            /*!< fast position estimator deviation high byte */
#define EDIM_HDSL_MAXDEV_L_DEVL           BITS(0,7)                            /*!< fast position estimator deviation low byte */

/* EDIM_HDSL_DUMMY */
#define EDIM_HDSL_DUMMY_DUMMY             BITS(0,7)                            /*!< DUMMY */

/* EDIM_HDSL_MIR_STn */
#define EDIM_HDSL_MIR_ST_MIRST            BITS(0,7)                            /*!< mirror status, byte n */
#define EDIM_HDSL_MIR_ST_BIT(n)           BIT(n)                               /*!< mirror status, bit n */

/* EDIM_HDSL_VPOSn */
#define EDIM_HDSL_VPOS_VPOS               BITS(0,7)                            /*!< safe position, byte n */

/* EDIM_HDSL_VPOSCRC_H */
#define EDIM_HDSL_VPOSCRC_H_VPOSCRCH      BITS(0,7)                            /*!< CRC of the safe position, bit 15 to bit 8 */

/* EDIM_HDSL_VPOSCRC_L */
#define EDIM_HDSL_VPOSCRC_L_VPOSCRCL      BITS(0,7)                            /*!< CRC of the safe position, bit 7 to bit 0 */

/* EDIM_HDSL_SAFE_CTRL */
#define EDIM_HDSL_SAFE_CTRL_MRST          BIT(6)                               /*!< message reset */
#define EDIM_HDSL_SAFE_CTRL_PRST          BIT(7)                               /*!< protocol reset */

/* EDIM_HDSL_SAFE_SUM */
#define EDIM_HDSL_SAFE_SUM_SSUM           BITS(0,7)                            /*!< status summary bit */

/* EDIM_HDSL_S_PC_DATA */
#define EDIM_HDSL_S_PC_DATA_SPCDATA       BITS(0,7)                            /*!< "short message" parameter channel data */

/* EDIM_HDSL_EVENT_S */
#define EDIM_HDSL_EVENT_S_FRES            BIT(0)                               /*!< channel free for "short message" */
#define EDIM_HDSL_EVENT_S_MIN             BIT(1)                               /*!< message init */
#define EDIM_HDSL_EVENT_S_PRST            BIT(2)                               /*!< protocol reset warning */
#define EDIM_HDSL_EVENT_S_QMLW            BIT(3)                               /*!< quality monitoring low-value warning */
#define EDIM_HDSL_EVENT_S_VPOS            BIT(4)                               /*!< safe position error */
#define EDIM_HDSL_EVENT_S_SCE             BIT(5)                               /*!< error on the safe channel */
#define EDIM_HDSL_EVENT_S_SSUM            BIT(6)                               /*!< remote event monitoring */
#define EDIM_HDSL_EVENT_S_SINT            BIT(7)                               /*!< safe interrupt status */

/* EDIM_HDSL_MASK_S */
#define EDIM_HDSL_MASK_S_MFRES            BIT(0)                               /*!< mask for channel free for "short message" */
#define EDIM_HDSL_MASK_S_MMIN             BIT(1)                               /*!< mask for message init */
#define EDIM_HDSL_MASK_S_MPRST            BIT(2)                               /*!< mask for protocol reset warning */
#define EDIM_HDSL_MASK_S_MQMLW            BIT(3)                               /*!< mask for quality monitoring low-value warning */
#define EDIM_HDSL_MASK_S_MVPOS            BIT(4)                               /*!< mask for safe position error */
#define EDIM_HDSL_MASK_S_MSCE             BIT(5)                               /*!< mask for error on the safe channel */
#define EDIM_HDSL_MASK_S_MSSUM            BIT(6)                               /*!< mask for remote event monitoring */

/* EDIM_HDSL_ENC_STn */
#define EDIM_HDSL_ENC_ST_ENCST            BITS(0,7)                            /*!< encoder status, byte n */
#define EDIM_HDSL_ENC_ST_BIT(n)           BIT(n)                               /*!< encoder status, bit n */

/* EDIM_HDSL_SRSSI */
#define EDIM_HDSL_SRSSI_SRSSI             BITS(0,2)                            /*!< value of the slave RSSI */

/* EDIM_HDSL_MAIL */
#define EDIM_HDSL_MAIL_MAIL               BITS(0,7)                            /*!< slave-Mail */

/* EDIM_HDSL_PING */
#define EDIM_HDSL_PING_PING               BITS(0,7)                            /*!< slave-Ping */

/* EDIM_HDSL_VERSION2 */
#define EDIM_HDSL_VERSION2_MINOR          BITS(0,3)                            /*!< minor release number */
#define EDIM_HDSL_VERSION2_MAJOR          BITS(4,5)                            /*!< major release number */
#define EDIM_HDSL_VERSION2_CODE           BITS(6,7)                            /*!< type of module */

