wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_hdsl.h
/* EDIM_HDSL_ENC2_ID */
#define EDIM_HDSL_ENC2_ID_ENC2ID          BITS(0,7)                            /*!< designation of the safe channel 2 channel */

/* EDIM_HDSL_STATUS2 */
#define EDIM_HDSL_STATUS2_FIX2            BITS(0,4)                            /*!< safe channel 2 fixed bit pattern */
#define EDIM_HDSL_STATUS2_ERR2            BIT(5)                               /*!< safe channel 2 position error */
#define EDIM_HDSL_STATUS2_TEST2           BIT(6)                               /*!< safe channel 2 test */
#define EDIM_HDSL_STATUS2_TOG2            BIT(7)                               /*!< safe channel 2 toggle */

/* EDIM_HDSL_VPOS2n */
#define EDIM_HDSL_VPOS2_VPOS2            BITS(0,7)                            /*!< safe position, Channel 2, byte n */

/* EDIM_HDSL_VPOSCRC2_H */
#define EDIM_HDSL_VPOSCRC2_H_VPOSCRC2H    BITS(0,7)                            /*!< CRC of the safe position 2, bit 15 to bit 8 */

/* EDIM_HDSL_VPOSCRC2_L */
#define EDIM_HDSL_VPOSCRC2_L_VPOSCRC2L    BITS(0,7)                            /*!< CRC of the safe position 2, bit 7 to bit 0 */

/* EDIM_HDSL_DUMMY2 */
#define EDIM_HDSL_DUMMY2_DUMMY            BITS(0,7)                            /*!< DUMMY */

/* EDIM_HDSL_CTL */
#define EDIM_HDSL_CTL_ENDIAN              BIT(0)                               /*!< HIPERFACE DSL unit 0 endian Mode */
#define EDIM_HDSL_CTL_SSEL1               BIT(1)                               /*!< HIPERFACE DSL unit 0 safe channel 1 interface select */ 
#define EDIM_HDSL_CTL_DSEL                BIT(2)                               /*!< HIPERFACE DSL unit 0 driver interface select */
#define EDIM_HDSL_CTL_SSEL2               BIT(3)                               /*!< HIPERFACE DSL unit 0 safe channel 2 interface select */ 

/* EDIM_HDSL_ONLINE_STATUS_D */
#define EDIM_HDSL_ONLINE_STATUS_D_FREL         BIT(1)                               /*!< channel status for long message */
#define EDIM_HDSL_ONLINE_STATUS_D_QMLW         BIT(2)                               /*!< quality monitoring at low level */
#define EDIM_HDSL_ONLINE_STATUS_D_ANS          BIT(4)                               /*!< incorrect answer detected */
#define EDIM_HDSL_ONLINE_STATUS_D_MIN          BIT(5)                               /*!< acknowledgment of message Initialization */
#define EDIM_HDSL_ONLINE_STATUS_D_POSTX        BITS(6,7)                            /*!< position transmission status */
#define EDIM_HDSL_ONLINE_STATUS_D_PRST         BIT(8)                               /*!< protocol reset */
#define EDIM_HDSL_ONLINE_STATUS_D_DTE          BIT(9)                               /*!< deviation threshold error */
#define EDIM_HDSL_ONLINE_STATUS_D_POS          BIT(11)                              /*!< estimator turned on */
#define EDIM_HDSL_ONLINE_STATUS_D_SUM          BIT(14)                              /*!< summary byte */
#define EDIM_HDSL_ONLINE_STATUS_D_INT          BIT(15)                              /*!< status of the interrupt signal */

/* EDIM_HDSL_ONLINE_STATUS_1 */
#define EDIM_HDSL_ONLINE_STATUS_1_FRES         BIT(0)                               /*!< channel Status for the short message */
#define EDIM_HDSL_ONLINE_STATUS_1_QMLW         BIT(2)                               /*!< quality monitoring at low level */
#define EDIM_HDSL_ONLINE_STATUS_1_MIN          BIT(5)                               /*!< acknowledgment of message Initialization */
#define EDIM_HDSL_ONLINE_STATUS_1_POSTX        BITS(6,7)                            /*!< position transmission status */
#define EDIM_HDSL_ONLINE_STATUS_1_PRST         BIT(8)                               /*!< protocol reset */
#define EDIM_HDSL_ONLINE_STATUS_1_VPOS         BIT(10)                              /*!< safe Position Invalid */
#define EDIM_HDSL_ONLINE_STATUS_1_SCE          BIT(13)                              /*!< CRC Error on the Safe Channel */
#define EDIM_HDSL_ONLINE_STATUS_1_SSUM         BIT(14)                              /*!< Safe summary bit */
#define EDIM_HDSL_ONLINE_STATUS_1_SINT         BIT(15)                              /*!< status of the interrupt signal */

/* EDIM_HDSL_ONLINE_STATUS_2 */
#define EDIM_HDSL_ONLINE_STATUS_2_QMLW         BIT(2)                               /*!< quality monitoring at low level */
#define EDIM_HDSL_ONLINE_STATUS_2_POSTX        BITS(6,7)                            /*!< position transmission status */
#define EDIM_HDSL_ONLINE_STATUS_2_PRST         BIT(8)                               /*!< protocol reset */
#define EDIM_HDSL_ONLINE_STATUS_2_VPOS2        BIT(10)                              /*!< safe Position 2 Invalid */
#define EDIM_HDSL_ONLINE_STATUS_2_SCE2         BIT(13)                              /*!< transmission Error Channel 2 */
#define EDIM_HDSL_ONLINE_STATUS_2_SSUM2        BIT(14)                              /*!< summary byte Channel 2 */

/* EDIM_HDSL_SYNLK */
#define EDIM_HDSL_SYNLK_SYNLK                  BIT(0)                               /*!< position sampling resolution locked */

/* EDIM_HDSL_INTEN */
#define EDIM_HDSL_INTEN_INTSRC                 BITS(0,3)                            /*!< POSTX interrupt source */
#define EDIM_HDSL_INTEN_POSTXIE                BIT(8)                               /*!< POSTX interrupt enable */
#define EDIM_HDSL_INTEN_INTSIE                 BIT(9)                               /*!< Interrupt_s enable */

/* constants definitions */
/* Polarity of the synchronization pulse */
#define EDIM_HDSL_SYNC_TRAILING                ((uint8_t)0x00U)                     /*!< the SYNC trailing edge is used */
#define EDIM_HDSL_SYNC_LEADING                 EDIM_HDSL_SYS_CTRL_SPOL              /*!< the SYNC leading edge is used */
                                                                                    
/* EDIM_HDSL flag definitions */ 
#define EDIM_HDSL_FLAG_MASK                    ((uint32_t)0x00004B36U)
#define EDIM_HDSL_FLAG_PRST                    (EDIM_HDSL_EVENT_H_PRST << 8)        /*!< protocol reset warning */
#define EDIM_HDSL_FLAG_DTE                     (EDIM_HDSL_EVENT_H_DTE << 8)         /*!< estimator deviation threshold error */
#define EDIM_HDSL_FLAG_POS                     (EDIM_HDSL_EVENT_H_POS << 8)         /*!< estimator turned on */
#define EDIM_HDSL_FLAG_SUM                     (EDIM_HDSL_EVENT_H_SUM << 8)         /*!< remote event monitoring */
#define EDIM_HDSL_FLAG_INT                     (EDIM_HDSL_EVENT_H_INT << 8)         /*!< interrupt status */
#define EDIM_HDSL_FLAG_FREL                    EDIM_HDSL_EVENT_L_FREL               /*!< channel free for "long message" */
#define EDIM_HDSL_FLAG_QMLW                    EDIM_HDSL_EVENT_L_QMLW               /*!< quality monitoring low-value warning */
#define EDIM_HDSL_FLAG_ANS                     EDIM_HDSL_EVENT_L_ANS                /*!< erroneous answer to "long message" */
#define EDIM_HDSL_FLAG_MIN                     EDIM_HDSL_EVENT_L_MIN                /*!< message initialization */
                                                                                    
/* EDIM_HDSL interrupt enable definitions */
#define EDIM_HDSL_INTEN_MASK                   ((uint32_t)0x00004B36U)
#define EDIM_HDSL_INT_PRST                     (EDIM_HDSL_MASK_H_MPRST << 8)        /*!< Protocol reset warning */
#define EDIM_HDSL_INT_DTE                      (EDIM_HDSL_MASK_H_MDTE << 8)         /*!< Estimator deviation threshold error */
#define EDIM_HDSL_INT_POS                      (EDIM_HDSL_MASK_H_MPOS << 8)         /*!< Estimator turned on */
#define EDIM_HDSL_INT_SUM                      (EDIM_HDSL_MASK_H_MSUM << 8)         /*!< Remote event monitoring */
#define EDIM_HDSL_INT_FREL                     EDIM_HDSL_MASK_L_MFREL               /*!< Channel free for "long message" */
#define EDIM_HDSL_INT_QMLW                     EDIM_HDSL_MASK_L_MQMLW               /*!< Quality monitoring low-value warning */
#define EDIM_HDSL_INT_ANS                      EDIM_HDSL_MASK_L_MANS                /*!< Erroneous answer to "long message" */
#define EDIM_HDSL_INT_MIN                      EDIM_HDSL_MASK_L_MMIN                /*!< Message initialization */

/* EDIM_HDSL interrupt flag definitions */ 
#define EDIM_HDSL_INT_FLAG_MASK                ((uint32_t)0x00004B36U)
#define EDIM_HDSL_INT_FLAG_PRST                (EDIM_HDSL_EVENT_H_PRST << 8)        /*!< Protocol reset warning */
#define EDIM_HDSL_INT_FLAG_DTE                 (EDIM_HDSL_EVENT_H_DTE << 8)         /*!< Estimator deviation threshold error */
#define EDIM_HDSL_INT_FLAG_POS                 (EDIM_HDSL_EVENT_H_POS << 8)         /*!< Estimator turned on */
#define EDIM_HDSL_INT_FLAG_SUM                 (EDIM_HDSL_EVENT_H_SUM << 8)         /*!< Remote event monitoring */
#define EDIM_HDSL_INT_FLAG_FREL                EDIM_HDSL_EVENT_L_FREL               /*!< Channel free for "long message" */
#define EDIM_HDSL_INT_FLAG_QMLW                EDIM_HDSL_EVENT_L_QMLW               /*!< Quality monitoring low-value warning */
#define EDIM_HDSL_INT_FLAG_ANS                 EDIM_HDSL_EVENT_L_ANS                /*!< Erroneous answer to "long message" */
#define EDIM_HDSL_INT_FLAG_MIN                 EDIM_HDSL_EVENT_L_MIN                /*!< Message initialization */
                                                      
/* PC_ADD_H register bit define */
/* EDIM_HDSL data length of the "long message" */
#define ADD_H_LLEN(regval)                    (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define EDIM_HDSL_LONG_MSG_LEN_0              ADD_H_LLEN(0)                         /*!< No data bytes */
#define EDIM_HDSL_LONG_MSG_LEN_2              ADD_H_LLEN(1)                         /*!< 2 data bytes */
#define EDIM_HDSL_LONG_MSG_LEN_4              ADD_H_LLEN(2)                         /*!< 4 data bytes */
#define EDIM_HDSL_LONG_MSG_LEN_8              ADD_H_LLEN(3)                         /*!< 8 data bytes */

/* EDIM_HDSL indirect addressing of long messages */
#define EDIM_HDSL_LONG_MSG_DIRECT             ((uint8_t)0x00U)                      /*!< direct addressing of "long messages" */
#define EDIM_HDSL_LONG_MSG_INDIRECT           EDIM_HDSL_PC_ADD_H_LIND               /*!< indirect addressing of "long messages" */
                                                                                    
/* EDIM_HDSL Long message addressing mode/long message error */                  
#define EDIM_HDSL_LONG_MSG_WITHOUT_OFFSET     ((uint8_t)0x00U)                      /*!< addressing of "long message" without offset */
#define EDIM_HDSL_LONG_MSG_OFFSET             EDIM_HDSL_PC_ADD_H_LOFF               /*!< offset addressing of "long message" */
                                                                                    
/* EDIM_HDSL Long message addressing mode/long message error */                  
#define EDIM_HDSL_LONG_MSG_WRITE              ((uint8_t)0x00U)                      /*!< "long message" write operation */
#define EDIM_HDSL_LONG_MSG_READ               EDIM_HDSL_PC_ADD_H_LRW                /*!< "long message" read operation */

/* EDIM_HDSL sensorhub flag */ 
#define EDIM_HDSL_SENSORHUB_FLAG_PSCI         EDIM_HDSL_PIPE_S_PSCI                 /*!< Indication for special characters in the SensorHub Channel */
#define EDIM_HDSL_SENSORHUB_FLAG_PERR         EDIM_HDSL_PIPE_S_PERR                 /*!< Coding error of the bits in the SensorHub Channel */
#define EDIM_HDSL_SENSORHUB_FLAG_PEMP         EDIM_HDSL_PIPE_S_PEMP                 /*!< The SensorHub channel buffer is empty */
#define EDIM_HDSL_SENSORHUB_FLAG_POVR         EDIM_HDSL_PIPE_S_POVR                 /*!< SensorHub Channel overflow */

/* EDIM_HDSL max acceleration resolution */ 
#define EDIM_HDSL_MAXACC_RES_256              ((uint8_t)0x00U)                      /*!< acceleration boundary resolution is 256 */
#define EDIM_HDSL_MAXACC_RES_64               ((uint8_t)0x01U)                      /*!< acceleration boundary resolution is 64 */
#define EDIM_HDSL_MAXACC_RES_16               ((uint8_t)0x02U)                      /*!< acceleration boundary resolution is 16 */
#define EDIM_HDSL_MAXACC_RES_4                ((uint8_t)0x03U)                      /*!< acceleration boundary resolution is 4 */

/* EDIM_HDSL safe channel 1 event flag definitions */                                                         
#define EDIM_HDSL_SAFE_FLAG_FRES               EDIM_HDSL_EVENT_S_FRES               /*!< Channel free for "short message" */
#define EDIM_HDSL_SAFE_FLAG_MIN                EDIM_HDSL_EVENT_S_MIN                /*!< Message init */
#define EDIM_HDSL_SAFE_FLAG_PRST               EDIM_HDSL_EVENT_S_PRST               /*!< Protocol reset warning */
#define EDIM_HDSL_SAFE_FLAG_QMLW               EDIM_HDSL_EVENT_S_QMLW               /*!< Quality monitoring low-value warning */
#define EDIM_HDSL_SAFE_FLAG_VPOS               EDIM_HDSL_EVENT_S_VPOS               /*!< Safe position error */
#define EDIM_HDSL_SAFE_FLAG_SCE                EDIM_HDSL_EVENT_S_SCE                /*!< Error on the Safe Channel */
#define EDIM_HDSL_SAFE_FLAG_SSUM               EDIM_HDSL_EVENT_S_SSUM               /*!< Remote event monitoring */
#define EDIM_HDSL_SAFE_FLAG_SINT               EDIM_HDSL_EVENT_S_SINT               /*!< Safe interrupt status */
                                                                                    
/* EDIM_HDSL safe channel 1 event interrupt definitions */                                                    
#define EDIM_HDSL_SAFE_INT_FLAG_FRES           EDIM_HDSL_EVENT_S_FRES               /*!< Channel free for "short message" */
#define EDIM_HDSL_SAFE_INT_FLAG_MIN            EDIM_HDSL_EVENT_S_MIN                /*!< Message init */
#define EDIM_HDSL_SAFE_INT_FLAG_PRST           EDIM_HDSL_EVENT_S_PRST               /*!< Protocol reset warning */
#define EDIM_HDSL_SAFE_INT_FLAG_QMLW           EDIM_HDSL_EVENT_S_QMLW               /*!< Quality monitoring low-value warning */
#define EDIM_HDSL_SAFE_INT_FLAG_VPOS           EDIM_HDSL_EVENT_S_VPOS               /*!< Safe position error */
#define EDIM_HDSL_SAFE_INT_FLAG_SCE            EDIM_HDSL_EVENT_S_SCE                /*!< Error on the Safe Channel */
#define EDIM_HDSL_SAFE_INT_FLAG_SSUM           EDIM_HDSL_EVENT_S_SSUM               /*!< Remote event monitoring */

