wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_hdsl.h
/* EDIM_HDSL safe channel 1 event interrupt enable definitions */
#define EDIM_HDSL_SAFE_INT_FRES                EDIM_HDSL_MASK_S_MFRES               /*!< Interrupt enable for channel free for "short message" */
#define EDIM_HDSL_SAFE_INT_MIN                 EDIM_HDSL_MASK_S_MMIN                /*!< Interrupt enable for message init */
#define EDIM_HDSL_SAFE_INT_PRST                EDIM_HDSL_MASK_S_MPRST               /*!< Interrupt enable for protocol reset warning */
#define EDIM_HDSL_SAFE_INT_QMLW                EDIM_HDSL_MASK_S_MQMLW               /*!< Interrupt enable for quality monitoring low-value warning */
#define EDIM_HDSL_SAFE_INT_VPOS                EDIM_HDSL_MASK_S_MVPOS               /*!< Interrupt enable for safe position error */
#define EDIM_HDSL_SAFE_INT_SCE                 EDIM_HDSL_MASK_S_MSCE                /*!< Interrupt enable for error on the Safe Channel */
#define EDIM_HDSL_SAFE_INT_SSUM                EDIM_HDSL_MASK_S_MSSUM               /*!< Interrupt enable for remote event monitoring */

/* EDIM_HDSL safe channel 2 flag definitions */                                                         
#define EDIM_HDSL_SAFE2_FLAG_ERR               EDIM_HDSL_STATUS2_ERR2               /*!< Safe Channel 2 Position Error */
#define EDIM_HDSL_SAFE2_FLAG_TEST              EDIM_HDSL_STATUS2_TEST2              /*!< Safe Channel 2 Test */
#define EDIM_HDSL_SAFE2_FLAG_TOG               EDIM_HDSL_STATUS2_TOG2               /*!< Safe Channel 2 Toggle */

/* EDIM_HDSL endian mode */
#define EDIM_HDSL_ENDIAN_MODE_BIG              ((uint8_t)0x00U)                     /*!< Big endian mode */
#define EDIM_HDSL_ENDIAN_MODE_LITTLE           ((uint8_t)0x01U)                     /*!< Little endian mode */

/* EDIM_HDSL channel selection */
#define EDIM_HDSL_DRIVE                        ((uint8_t)0x00U)                     /*!< HDSL unit0 drive*/
#define EDIM_HDSL_SAFE_CHANNEL1                ((uint8_t)0x01U)                     /*!< HDSL unit0 safe channel 1 */
#define EDIM_HDSL_SAFE_CHANNEL2                ((uint8_t)0x02U)                     /*!< HDSL unit0 safe channel 2 */

/* EDIM_HDSL interface */
#define EDIM_HDSL_BUS_INTERFACE                ((uint8_t)0x00U)                     /*!< Internal bus interface */
#define EDIM_HDSL_SPI_INTERFACE                ((uint8_t)0x01U)                     /*!< SPI interface */

/* EDIM_HDSL online drive flag */
#define EDIM_HDSL_ONLINE_D_FLAG_FREL           EDIM_HDSL_ONLINE_STATUS_D_FREL       /*!< channel status for long message */
#define EDIM_HDSL_ONLINE_D_FLAG_QMLW           EDIM_HDSL_ONLINE_STATUS_D_QMLW       /*!< quality monitoring at low level */
#define EDIM_HDSL_ONLINE_D_FLAG_ANS            EDIM_HDSL_ONLINE_STATUS_D_ANS        /*!< incorrect answer detected */
#define EDIM_HDSL_ONLINE_D_FLAG_MIN            EDIM_HDSL_ONLINE_STATUS_D_MIN        /*!< acknowledgment of message initialization */
#define EDIM_HDSL_ONLINE_D_FLAG_PRST           EDIM_HDSL_ONLINE_STATUS_D_PRST       /*!< protocol reset */
#define EDIM_HDSL_ONLINE_D_FLAG_DTE            EDIM_HDSL_ONLINE_STATUS_D_DTE        /*!< deviation threshold error */
#define EDIM_HDSL_ONLINE_D_FLAG_POS            EDIM_HDSL_ONLINE_STATUS_D_POS        /*!< estimator turned on */
#define EDIM_HDSL_ONLINE_D_FLAG_SUM            EDIM_HDSL_ONLINE_STATUS_D_SUM        /*!< summary byte */
#define EDIM_HDSL_ONLINE_D_FLAG_INT            EDIM_HDSL_ONLINE_STATUS_D_INT        /*!< status of the interrupt signal */

/* EDIM_HDSL online safe channel 1 flag */
#define EDIM_HDSL_ONLINE_1_FLAG_FRES           EDIM_HDSL_ONLINE_STATUS_1_FRES       /*!< channel status for the short message */
#define EDIM_HDSL_ONLINE_1_FLAG_QMLW           EDIM_HDSL_ONLINE_STATUS_1_QMLW       /*!< quality monitoring at low level */
#define EDIM_HDSL_ONLINE_1_FLAG_MIN            EDIM_HDSL_ONLINE_STATUS_1_MIN        /*!< acknowledgment of message Initialization */
#define EDIM_HDSL_ONLINE_1_FLAG_PRST           EDIM_HDSL_ONLINE_STATUS_1_PRST       /*!< protocol reset */
#define EDIM_HDSL_ONLINE_1_FLAG_VPOS           EDIM_HDSL_ONLINE_STATUS_1_VPOS       /*!< safe position invalid */
#define EDIM_HDSL_ONLINE_1_FLAG_SCE            EDIM_HDSL_ONLINE_STATUS_1_SCE        /*!< CRC Error on the Safe Channel */
#define EDIM_HDSL_ONLINE_1_FLAG_SSUM           EDIM_HDSL_ONLINE_STATUS_1_SSUM       /*!< Safe summary bit */
#define EDIM_HDSL_ONLINE_1_FLAG_SINT           EDIM_HDSL_ONLINE_STATUS_1_SINT       /*!< Status of the interrupt signal */

/* EDIM_HDSL online safe channel 2 flag */
#define EDIM_HDSL_ONLINE_2_FLAG_QMLW           EDIM_HDSL_ONLINE_STATUS_2_QMLW       /*!< quality monitoring at low level */
#define EDIM_HDSL_ONLINE_2_FLAG_PRST           EDIM_HDSL_ONLINE_STATUS_2_PRST       /*!< protocol reset */
#define EDIM_HDSL_ONLINE_2_FLAG_VPOS2          EDIM_HDSL_ONLINE_STATUS_2_VPOS2      /*!< safe position 2 invalid */
#define EDIM_HDSL_ONLINE_2_FLAG_SCE2           EDIM_HDSL_ONLINE_STATUS_2_SCE2       /*!< transmission error channel 2 */
#define EDIM_HDSL_ONLINE_2_FLAG_SSUM2          EDIM_HDSL_ONLINE_STATUS_2_SSUM2      /*!< summary byte channel 2 */

/* EDIM_HDSL POSTX interrupt source */
#define EDIM_HDSL_POSTX_SRC_01                 ((uint32_t)0x00000000U)              /*!< when POSTX=2'b01 */
#define EDIM_HDSL_POSTX_SRC_10                 ((uint32_t)0x00000001U)              /*!< when POSTX=2'b10 */
#define EDIM_HDSL_POSTX_SRC_11                 ((uint32_t)0x00000002U)              /*!< when POSTX=2'b11 */
#define EDIM_HDSL_POSTX_SRC_01_10_11           ((uint32_t)0x00000003U)              /*!< when POSTX = 2'b01, 2'b10, 2'b11 */
#define EDIM_HDSL_POSTX_SRC_00_TO_01           ((uint32_t)0x00000004U)              /*!< when POSTX transfer from 2'b00 to 2'b01 */
#define EDIM_HDSL_POSTX_SRC_00_TO_10           ((uint32_t)0x00000005U)              /*!< when POSTX transfer from 2'b00 to 2'b10 */
#define EDIM_HDSL_POSTX_SRC_00_TO_01_10        ((uint32_t)0x00000007U)              /*!< when POSTX transfer from 2'b00 to 2'b01 or 2'b10 */
#define EDIM_HDSL_POSTX_SRC_01_TO_10           ((uint32_t)0x00000008U)              /*!< when POSTX transfer from 2'b01 to 2'b10 */
#define EDIM_HDSL_POSTX_SRC_10_TO_11           ((uint32_t)0x00000009U)              /*!< when POSTX transfer from 2'b10 to 2'b11 */
#define EDIM_HDSL_POSTX_SRC_CHANGES            ((uint32_t)0x0000000AU)              /*!< when POSTX changes */


/* edim_hdsl sent long message parameter struct definitions */
typedef struct
{
    uint8_t direction;                                                              /*!< long message, read/write mode */
    uint8_t offset;                                                                 /*!< with offset/withoutoffset */
    uint8_t d_i_mode;                                                               /*!< direct/indirect addressing */
    uint8_t len;                                                                    /*!< long message length */
    uint8_t laddh;                                                                  /*!< long message address, bit 9 to bit 8 (database entry with 10-bit address for a "long message" operation)*/
    uint8_t laddl;                                                                  /*!< long message address, bit 7 to bit 0(database entry with 10-bit address for a "long message" operation) */
    uint8_t ladd_off_l;                                                             /*!< long message address offset, byte 0 */
    uint8_t ladd_off_h;                                                             /*!< long message address offset, byte 1 */
} edim_hdsl_long_msg_addr_struct;

/* function declarations */
/* initialization functions */
/* reset EDIM_HDSL */
void edim_hdsl_deinit(void);
/* initialize edim_hdsl */
void edim_hdsl_init(uint8_t es, uint8_t sync_polarity, uint8_t acc_err_cnt);
/* activation of the output */
void edim_hdsl_output_enable(void);
/* unactivation of the output */
void edim_hdsl_output_disable(void);
/* test drive interface */
void edim_hdsl_test_drive_interface(ControlStatus newvalue);
/* reset pipeline fifo */
void edim_hdsl_pipeline_fifo_reset(ControlStatus newvalue);
/* reset message */
void edim_hdsl_message_reset(ControlStatus newvalue);
/* reset protocol status */
void edim_hdsl_protocol_reset(ControlStatus newvalue);

/* quality monitoring functions */
/* get quality monitoring bits */
uint8_t edim_hdsl_quality_monitoring_get(void);
/* get DSL protocol connection status */
FlagStatus edim_hdsl_protocol_connection_status_get(void);

