wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_hdsl.h
/* synchronization functions */
/* get hdsl position sampling resolution lock */
FlagStatus edim_hdsl_position_sampling_resolution_lock_get(void);
/* configure hdsl POSTX interrupt source */
void edim_hdsl_postx_interrupt_source_select(uint32_t source);
/* enable POSTX interrupt */
void edim_hdsl_postx_interrupt_enable(void);
/* disable POSTX interrupt */
void edim_hdsl_postx_interrupt_disable(void);
/* enable safe channel 1 global interrupt */
void edim_hdsl_safe_channel1_global_interrupt_enable(void);
/* disable safe channel 1 global interrupt */
void edim_hdsl_safe_channel1_global_interrupt_disable(void);

/* status functions */
/* get EDIM_HDSL online d flag */
FlagStatus edim_hdsl_online_d_flag_get(uint32_t flag);
/* get online d position transmission status */
uint8_t edim_hdsl_online_d_position_transmission_status_get(void);
/* get EDIM_HDSL online 1 flag */
FlagStatus edim_hdsl_online_1_flag_get(uint32_t flag);
/* get online 1 position transmission status */
uint8_t edim_hdsl_online_1_position_transmission_status_get(void);
/* get EDIM_HDSL online 2 flag */
FlagStatus edim_hdsl_online_2_flag_get(uint32_t flag);
/* get online 2 position transmission status */
uint8_t edim_hdsl_online_2_position_transmission_status_get(void);

/* flag and interrupt functions */
/* get EDIM_HDSL flag status */
FlagStatus edim_hdsl_flag_get(uint32_t flag);
/* clear EDIM_HDSL flag status */
void edim_hdsl_flag_clear(uint32_t flag);
/* enable EDIM_HDSL interrupt */
void edim_hdsl_interrupt_enable(uint32_t interrupt);
/* disable EDIM_HDSL interrupt */
void edim_hdsl_interrupt_disable(uint32_t interrupt);
/* enable mirror sum bit set the sum event monitoring in the EVENT_H register and the interrupt signal */
void edim_hdsl_mir_sum_event_enable(uint32_t flag);
/* disable mirror sum bit set the sum event monitoring in the EVENT_H register and the interrupt signal */
void edim_hdsl_mir_sum_event_disable(uint32_t flag);
/* get EDIM_HDSL interrupt event flag */
FlagStatus edim_hdsl_interrupt_flag_get(uint32_t flag);
/* clear EDIM_HDSL interrupt event flag */
void edim_hdsl_interrupt_flag_clear(uint32_t flag);
/* get EDIM_HDSL safe channel 1 event flag */
FlagStatus edim_hdsl_safe_channel1_flag_get(uint8_t flag);
/* clear EDIM_HDSL safe channel 1 event flag */
void edim_hdsl_safe_channel1_flag_clear(uint8_t flag);
/* enable EDIM_HDSL safe channel 1 interrupt */
void edim_hdsl_safe_channel1_interrupt_enable(uint8_t interrupt);
/* disable EDIM_HDSL safe channel 1 interrupt */
void edim_hdsl_safe_channel1_interrupt_disable(uint8_t interrupt);
/* get EDIM_HDSL safe channel 1 interrupt event flag */
FlagStatus edim_hdsl_safe_channel1_interrupt_flag_get(uint8_t flag);
/* clear EDIM_HDSL safe channel 1 event flag */
void edim_hdsl_safe_channel1_interrupt_flag_clear(uint8_t flag);
/* get EDIM_HDSL safe channel 2 flag */
FlagStatus edim_hdsl_safe_channel2_flag_get(uint8_t flag);

#endif /* GD32H77X_EDIM_HDSL_H */